Gadget/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НаборПрав</name>
    <attributes>
      <name>ИмяРоли</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеРоли</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Активно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Gadget/src/Catalogs/Пользователи/ObjectModule.bsl
// Заполнить набор прав.
// 
// Параметры:
//  ПользовательИБ - ПользовательИнформационнойБазы - передается пользователь инф. базы
Процедура ЗаполнитьНаборПрав(ПользовательИБ) Экспорт
	
	РолиИБ = Метаданные.Роли;
	
	ЭтотОбъект.НаборПрав.Очистить();
	
	Для Каждого Роль Из РолиИБ Цикл
		
		СтрокаНабора = ЭтотОбъект.НаборПрав.Добавить();
		
		СтрокаНабора.ИмяРоли 			= Роль.Имя;
		СтрокаНабора.ПредставлениеРоли	= Роль.Синоним;
		СтрокаНабора.Активно			= ПользовательИБ.Роли.Содержит(Роль);
		
	КонецЦикла;
	
КонецПроцедуры



Процедура ПриЗаписи(Отказ)
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ЭтотОбъект.Наименование);
	
	Если ПользовательИБ = Неопределено Тогда
		
		ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
		ПользовательИБ.Имя = Наименование;
		ПользовательИБ.ПолноеИмя = ПолноеИмя;
		
		НаборПравПользователя = ЭтотОбъект.НаборПрав.НайтиСтроки(Новый Структура("Активно", Истина));
		Для Каждого СтрокаНабораПрав Из НаборПравПользователя Цикл
			
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.Найти(СтрокаНабораПрав.ИмяРоли));
			
		КонецЦикла;
		
		ПользовательИБ.Записать();
		
	КонецЕсли;

КонецПроцедуры
